server/src/tests/performanceTest/helpTest/stress-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Baseline"
    - duration: 120
      arrivalRate: 2
      name: "Medium stress"
    - duration: 180
      arrivalRate: 3
      name: "High stress"
    - duration: 120
      arrivalRate: 2
      name: "Maximum stress"
    - duration: 60
      arrivalRate: 1
      name: "Recovery"
  defaults:
    headers:
      Content-Type: "application/json"
  timeout: 45

scenarios:
  - name: "Create Help Request"
    weight: 40
    flow:
      - post:
          url: "/api/help/add"
          json:
            name: "Stress Test Help {{ $randomString(5) }}"
            location: "Location {{ $randomString(3) }}"
            disasterType: "{{ $randomChoice(['flood', 'tsunami', 'landslide', 'cyclone', 'other']) }}"
            message: "High volume help request test"
            contactNumber: "{{ $randomNumber(1000000000, 9999999999) }}"
            realLocation: "40.7128,-74.0060"
          expect:
            - statusCode: 201

  - name: "List and Retrieve Help Requests"
    weight: 30
    flow:
      - get:
          url: "/api/help/"
          expect:
            - statusCode: 200

  - name: "Detailed Help Request Operations"
    weight: 20
    flow:
      - get:
          url: "/api/help/getid/000000000000000000000001"
          expect:
            - statusCode: [200, 404]
      - put:
          url: "/api/help/update/000000000000000000000001"
          json:
            status: "resolved"
            resolutionNotes: "Help provided during stress test"
          expect:
            - statusCode: [200, 404]

  - name: "Delete Help Request"
    weight: 10
    flow:
      - delete:
          url: "/api/help/delete/000000000000000000000001"
          expect:
            - statusCode: [200, 404]